import React from 'react';
import { renderWithTheme } from '../../../test/utils';

import About from './';

jest.mock('../../components/page-header', () => ({ title, description }) => (
  <div>
    {title} {description}
  </div>
));

describe('about page', () => {
  it('should render', () => {
    const { container } = renderWithTheme(<About />);

    expect(container).toMatchInlineSnapshot(`
      <div>
        <div>
          За мен
           
          Моята история
        </div>
        <div
          class="image-section__ImageContainer-sc-1qjyve1-0 jmhPHN"
        >
          <img
            src="[object Object]"
          />
        </div>
        <div
          class="content__AboutContainer-sc-1x7u39y-0 kDTlao"
        >
          <p>
            Казвам се Димитранка Георгиева и споделям с вас, че съм подвластна на магията на дървото! Това, за някои може да звучи смешно, несериозно или налудничево, но за мен си е самата истина.
          </p>
          <h3>
            от кръжока по дърворезба…
          </h3>
          <p>
            Когато бях в 7-ми клас, в основното училище имахме за няколко месеца (само толкова, защото учителя напусна) кръжок по дърворезба. Тогава дървото реши да ме омагьоса или по-скоро да ми покаже своята омая.
          </p>
          <h3>
            решението на родителите…
          </h3>
          <p>
            Днес след толкова години осъзнавам, че е трябвало да бъда по настоятелна пред родителите си и по-специално към майка си. Тогава, не ми позволиха да продължа образованието си в тази насока, дърворезбата. Думите на майка ми, че „тази професия е за мъже и да съм цял живот в „опилки“, не е добре за мен“, ме лишиха от масторските познания, методи и тайни. Избраха за мен друга професия, „Автоматизация на производството“ – ел техник. Тогава това училище беше от така наречените „елитни“. Влизаха само отличници. Да, те бяха горди с това, че тяхната дъщеря учи в такова училище, без да разберат моето желание.
          </p>
          <h3>
            през трудния период в живота…
          </h3>
          <p>
            Трябваше да минат доста години, за да излезе с по-голяма сила желанието ми да правя това, което ме влече. Имах труден период в живота си. Тогава, моят баща ми донесе комплект длета. Толкова се зарадвах! Още съм му благодарна за този миг! Първото си цветенце направих на дъската за рязане. Отдадох се на властта на дървото и то ме дари с успокоение. Кагато работя не мисля за нищо друго. Това ми помогна да преодолея лошите моменти. Превърна се в мое хоби. Мина още време и се случи така, че останах без работа. Въпреки уменията ми, натрупани през годините, минавайки 45-50 години, предпочитанията за работа са към по-младите.
          </p>
          <h3>
            до „вече съм свободна и щастлива“
          </h3>
          <p>
            Останала с много свободно време, разбрах каква късметлийка съм. Тази привилегия, да мога да предавам своите мисли и чувства дълбаейки дървото, ми е дадена от Бога. По този начин успявам да разпръсна магията във всеки дом, който отваря врати за истинските неща. А те идват от природата, която трябва да е с нас, да ни дава сили в забързания ни живот. Някой беше казал, че „Да правиш това, което харесваш, е Свобода! А да харесваш това, което правиш, е Щастие!
          </p>
          <p>
            <i>
              Аз вече съм свободна и щастлива!
            </i>
          </p>
        </div>
      </div>
    `);
  });
});
